hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
/**
 * unsigned char  uint8_t
 * unsigned short uint16_t
 * unsigned int   uint32_t
 */
#include "stm32f0xx.h"
#include "arm_math.h"
#include "stdlib.h"

#define CLOCK_SPEED 16000000
#define USART_BAUD_RATE 115200

#define USART1_TX_DMA_CHANNEL DMA1_Channel2
#define USART1_TDR_ADDRESS (unsigned int)(&(USART1->TDR))

#define USART_DATA_RECEIVED_FLAG 1
#define NETWORK_SEARCHING_STATUS_LED_FLAG 2
#define SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG 4

#define GET_VISIBLE_NETWORK_LIST_FLAG 1
#define DISABLE_ECHO_FLAG 2
#define CONNECT_TO_NETWORK_FLAG 4
#define CONNECTION_STATUS_FLAG 8
#define OBTAIN_CONNECTION_STATUS_FLAG 16
#define SERVER_PING_OK_STATUS_FLAG 32
#define GET_REQUEST_INITIATED_FLAG 64
#define CONNECT_TO_SERVER_FLAG 128
#define BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG 256
#define GET_REQUEST_SENT_FLAG 512
#define POST_REQUEST_SENT_FLAG 1024

#define USART_DATA_RECEIVED_BUFFER_SIZE 100
#define PIPED_REQUEST_COMMANDS_TO_SEND_SIZE 3
#define PIPED_REQUEST_CIPSTART_COMMAND_INDEX 0
#define PIPED_REQUEST_CIPSEND_COMMAND_INDEX 1
#define PIPED_REQUEST_INDEX 2

#define TIMER3_PERIOD_MS 0.13f
#define TIMER3_PERIOD_S (TIMER3_PERIOD_MS / 1000)
#define TIMER3_100MS (unsigned short)(100 / TIMER3_PERIOD_MS)

unsigned short piped_tasks_to_send[10];
char *piped_request_commands_to_send[PIPED_REQUEST_COMMANDS_TO_SEND_SIZE]; // AT+CIPSTART="TCP","address",port; AT+CIPSEND=bytes_to_send; request
unsigned int sent_flag;
unsigned int successfully_received_flags;
unsigned int general_flags;

char USART_OK[] __attribute__ ((section(".text.const"))) = "OK";
char USART_ERROR[] __attribute__ ((section(".text.const"))) = "ERROR";
char DEFAULT_ACCESS_POINT_NAME[] __attribute__ ((section(".text.const"))) = "Asus";
char DEFAULT_ACCESS_POINT_PASSWORD[] __attribute__ ((section(".text.const"))) = "";
char ESP8226_REQUEST_DISABLE_ECHO[] __attribute__ ((section(".text.const"))) = "ATE0\r\n";
char ESP8226_RESPONSE_BUSY[] __attribute__ ((section(".text.const"))) = "busy";
char ESP8226_REQUEST_GET_VISIBLE_NETWORK_LIST[] __attribute__ ((section(".text.const"))) = "AT+CWLAP\r\n";
char ESP8226_REQUEST_GET_CONNECTION_STATUS[] __attribute__ ((section(".text.const"))) = "AT+CWJAP?\r\n";
char ESP8226_RESPONSE_NOT_CONNECTED_STATUS[] __attribute__ ((section(".text.const"))) = "No AP";
char ESP8226_REQUEST_CONNECT_TO_NETWORK_AND_SAVE[] __attribute__ ((section(".text.const"))) = "AT+CWJAP_DEF=\"{1}\",\"{2}\"\r\n";
char ESP8226_REQUEST_GET_VERSION_ID[] __attribute__ ((section(".text.const"))) = "AT+GMR\r\n";
char ESP8226_RESPONSE_CONNECTED[] __attribute__ ((section(".text.const"))) = "CONNECT";
char ESP8226_CONNECTION_CLOSED[] __attribute__ ((section(".text.const"))) = "CLOSED";
char ESP8226_REQUEST_CONNECT_TO_SERVER[] __attribute__ ((section(".text.const"))) = "AT+CIPSTART=\"TCP\",\"{1}\",{2}\r\n";
char ESP8226_REQUEST_SERVER_PING[] __attribute__ ((section(".text.const"))) = "AT+PING=\"{1}\"\r\n";
char ESP8226_REQUEST_START_SENDING[] __attribute__ ((section(".text.const"))) = "AT+CIPSEND={1}\r\n";
char ESP8226_RESPONSE_START_SENDING_READY[] __attribute__ ((section(".text.const"))) = ">";
char ESP8226_RESPONSE_SENDING[] __attribute__ ((section(".text.const"))) = "busy s...";
char ESP8226_RESPONSE_SUCCSESSFULLY_SENT[] __attribute__ ((section(".text.const"))) = "SEND OK";
char ESP8226_RESPONSE_ALREADY_CONNECTED[] __attribute__ ((section(".text.const"))) = "ALREADY CONNECTED";

char *usart_data_to_be_transmitted_buffer = NULL;
char usart_data_received_buffer[USART_DATA_RECEIVED_BUFFER_SIZE];
volatile unsigned char usart_received_bytes;

void (*send_usart_data_function)() = NULL;
volatile unsigned int send_usart_data_timer_counter;
volatile unsigned short send_usart_data_timout_s = 0xFFFF;
volatile unsigned short send_usart_data_errors_counter;
volatile unsigned short network_searching_status_led_counter;
volatile unsigned short response_timeout_timer;

void Clock_Config();
void Pins_Config();
void TIMER3_Confing();
void TIMER6_Confing();
void set_flag(unsigned int *flags, unsigned int flag_value);
void reset_flag(unsigned int *flags, unsigned int flag_value);
unsigned char read_flag_state(unsigned int *flags, unsigned int flag_value);
void DMA_Config();
void USART_Config();
void set_appropriate_successfully_recieved_flag();
void disable_echo();
void get_network_list();
void connect_to_network();
void get_connection_status();
void execute_usart_data_sending(void (*function_to_execute)(), unsigned char timeout);
void send_usard_data(char string[]);
unsigned char is_usart_response_contains_elements(char *data_to_be_contained[], unsigned char elements_count);
unsigned char is_usart_response_contains_element(char string_to_be_contained[]);
unsigned char contains_string(char being_compared_string[], char string_to_be_contained[]);
void clear_usart_data_received_buffer();
void *set_string_parameters(char string[], char *parameters[]);
unsigned short get_string_length(char string[]);
unsigned short get_current_piped_task_to_send();
void remove_current_piped_task_to_send();
void add_piped_task_to_send(unsigned short task);
void on_successfully_receive_general_actions(unsigned short successfully_received_flag);
void send_usart_get_request(char address[], char port[], char request[]);
void *short_to_string(unsigned short number);
void connect_to_server();
void set_bytes_amount_to_send();

void DMA1_Channel2_3_IRQHandler() {
   DMA_ClearITPendingBit(DMA1_IT_TC2);
}

/**
 * TIM6 and DAC
 */
void TIM6_DAC_IRQHandler() {
   response_timeout_timer++;
   TIM_ClearITPendingBit(TIM6, TIM_IT_Update);
}

void TIM3_IRQHandler() {
   TIM_ClearITPendingBit(TIM3, TIM_IT_Update);

   if (usart_received_bytes > 0) {
      usart_received_bytes = 0;
      set_flag(&general_flags, USART_DATA_RECEIVED_FLAG);
   }
   if (send_usart_data_function != NULL) {
      send_usart_data_timer_counter++;
   }
   network_searching_status_led_counter++;
}

void USART1_IRQHandler() {
   if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET) {
      TIM_SetCounter(TIM3, 0);
      usart_data_received_buffer[usart_received_bytes] = USART_ReceiveData(USART1);
      usart_received_bytes++;

      if (usart_received_bytes >= USART_DATA_RECEIVED_BUFFER_SIZE) {
         usart_received_bytes = 0;
      }
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_ORE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_ORE);
      send_usart_data_errors_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_IDLE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_IDLE);
      send_usart_data_errors_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_NE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_NE);
      send_usart_data_errors_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_FE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_FE);
      send_usart_data_errors_counter++;
   }
}

