hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
int main() {
   Clock_Config();
   Pins_Config();
   DMA_Config();
   USART_Config();
   TIMER3_Confing();
   TIMER6_Confing();

   add_piped_task_to_send(DISABLE_ECHO_FLAG);
   add_piped_task_to_send(OBTAIN_CONNECTION_STATUS_FLAG);
   add_piped_task_to_send(SERVER_PING_OK_STATUS_FLAG);

   while (1) {
      // Seconds
      unsigned char send_usart_data_passed_time = (unsigned char)(TIMER3_PERIOD_S * send_usart_data_timer_counter);

      if (read_flag_state(&general_flags, USART_DATA_RECEIVED_FLAG)) {
         reset_flag(&general_flags, USART_DATA_RECEIVED_FLAG);
         send_usart_data_timer_counter = 0;

         if (usart_data_to_be_transmitted_buffer != NULL) {
            free(usart_data_to_be_transmitted_buffer);
            usart_data_to_be_transmitted_buffer = NULL;
         }

         set_appropriate_successfully_recieved_flag();
      } else if (send_usart_data_passed_time >= send_usart_data_timout_s) {
         send_usart_data_timer_counter = 0;
         if (usart_data_to_be_transmitted_buffer != NULL) {
            free(usart_data_to_be_transmitted_buffer);
            usart_data_to_be_transmitted_buffer = NULL;
         }

         if (send_usart_data_function != NULL) {
            send_usart_data_function();
         }
      }

      if (successfully_received_flags) {
         if (read_flag_state(&successfully_received_flags, DISABLE_ECHO_FLAG)) {
            on_successfully_receive_general_actions(DISABLE_ECHO_FLAG);
         }
         if (read_flag_state(&successfully_received_flags, OBTAIN_CONNECTION_STATUS_FLAG)) {
            reset_flag(&successfully_received_flags, OBTAIN_CONNECTION_STATUS_FLAG);

            if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
               // Has already been connected
               set_flag(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
               GPIO_WriteBit(GPIOA, GPIO_Pin_1, Bit_SET);
               on_successfully_receive_general_actions(0);
            } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
               // Connect
               add_piped_task_to_send(GET_VISIBLE_NETWORK_LIST_FLAG);
               add_piped_task_to_send(CONNECT_TO_NETWORK_FLAG);
               on_successfully_receive_general_actions(0);
            } else {
               send_usart_data_errors_counter++;
            }
         }
         if (read_flag_state(&successfully_received_flags, GET_VISIBLE_NETWORK_LIST_FLAG)) {
            on_successfully_receive_general_actions(GET_VISIBLE_NETWORK_LIST_FLAG);
         }
         if (read_flag_state(&successfully_received_flags, CONNECT_TO_NETWORK_FLAG)) {
            on_successfully_receive_general_actions(CONNECT_TO_NETWORK_FLAG);

            set_flag(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
            GPIO_WriteBit(GPIOA, GPIO_Pin_1, Bit_SET);
         }
         if (read_flag_state(&successfully_received_flags, CONNECT_TO_SERVER_FLAG)) {
            on_successfully_receive_general_actions(CONNECT_TO_SERVER_FLAG);
         }
         if (read_flag_state(&successfully_received_flags, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
            on_successfully_receive_general_actions(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
         }
      }

      unsigned short current_piped_task_to_send = get_current_piped_task_to_send();

      if (send_usart_data_function == NULL && current_piped_task_to_send) {
         if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
            execute_usart_data_sending(disable_echo, 10);
         } else if (current_piped_task_to_send == OBTAIN_CONNECTION_STATUS_FLAG) {
            execute_usart_data_sending(get_connection_status, 5);
         } else if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
            execute_usart_data_sending(get_network_list, 30);
         } else if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
            execute_usart_data_sending(connect_to_network, 10);
         } else if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
            execute_usart_data_sending(connect_to_server, 3);
         } else if (current_piped_task_to_send == BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG) {
            execute_usart_data_sending(set_bytes_amount_to_send, 2);
         } else if (current_piped_task_to_send == GET_REQUEST_SENT_FLAG) {
            execute_usart_data_sending(, 10);
         }
      }

      // LED blinking
      if (network_searching_status_led_counter >= TIMER3_100MS && !read_flag_state(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
         network_searching_status_led_counter = 0;

         if (read_flag_state(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG)) {
            reset_flag(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG);
            GPIO_WriteBit(GPIOA, GPIO_Pin_1, Bit_SET);
         } else {
            set_flag(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG);
            GPIO_WriteBit(GPIOA, GPIO_Pin_1, Bit_RESET);
         }
      }

      if (response_timeout_timer > 100) {
         response_timeout_timer = 0;

         send_usart_get_request("192.168.0.2", "80", "GET /extjs/tmp.txt HTTP/1.1\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n");
      }
   }
}

void send_usart_get_request(char address[], char port[], char request[]) {
   char *parameters[] = {address, port, NULL};
   piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX] = set_string_parameters(ESP8226_REQUEST_CONNECT_TO_SERVER, parameters);

   unsigned short request_length = get_string_length(request);
   char *request_length_string = short_to_string(request_length);
   char *start_sending_parameters[] = {request_length_string, NULL};
   piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX] = set_string_parameters(ESP8226_REQUEST_START_SENDING, start_sending_parameters);
   free(request_length_string);
   piped_request_commands_to_send[PIPED_REQUEST_INDEX] = request;

   add_piped_task_to_send(CONNECT_TO_SERVER_FLAG);
   add_piped_task_to_send(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
   add_piped_task_to_send(GET_REQUEST_SENT_FLAG);
}

