hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
void connect_to_server() {
   if (piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX]);
   set_flag(&sent_flag, CONNECT_TO_SERVER_FLAG);
}

void set_bytes_amount_to_send() {
   if (piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX]);
   set_flag(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
}

void set_appropriate_successfully_recieved_flag() {
   if (read_flag_state(&sent_flag, DISABLE_ECHO_FLAG)) {
      reset_flag(&sent_flag, DISABLE_ECHO_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         set_flag(&successfully_received_flags, DISABLE_ECHO_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      reset_flag(&sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
         set_flag(&successfully_received_flags, GET_VISIBLE_NETWORK_LIST_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, CONNECT_TO_NETWORK_FLAG)) {
      reset_flag(&sent_flag, CONNECT_TO_NETWORK_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         set_flag(&successfully_received_flags, CONNECT_TO_NETWORK_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG)) {
      reset_flag(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG);
      set_flag(&successfully_received_flags, OBTAIN_CONNECTION_STATUS_FLAG);
   }
   if (read_flag_state(&sent_flag, CONNECT_TO_SERVER_FLAG)) {
      reset_flag(&sent_flag, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2)) {
         set_flag(&successfully_received_flags, CONNECT_TO_SERVER_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }

   if (read_flag_state(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
      reset_flag(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_START_SENDING_READY)) {
         set_flag(&successfully_received_flags, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
}

void on_successfully_receive_general_actions(unsigned short successfully_received_flag) {
   if (successfully_received_flag) {
      reset_flag(&successfully_received_flags, successfully_received_flag);
   }
   send_usart_data_function = NULL;
   send_usart_data_errors_counter = 0;
   remove_current_piped_task_to_send();
}

unsigned short get_current_piped_task_to_send() {
   return piped_tasks_to_send[0];
}

void remove_current_piped_task_to_send() {
   for (unsigned char i = 0; piped_tasks_to_send[i] != 0; i++) {
      unsigned short next_task = piped_tasks_to_send[i + 1];
      piped_tasks_to_send[i] = next_task;
   }
}

void add_piped_task_to_send(unsigned short task) {
   for (unsigned char i = 0; i < 10; i++) {
      if (piped_tasks_to_send[i] == 0) {
         piped_tasks_to_send[i] = task;
         break;
      }
   }
}

unsigned char is_usart_response_contains_element(char string_to_be_contained[]) {
   if (contains_string(usart_data_received_buffer, string_to_be_contained)) {
      return 1;
   } else {
      return 0;
   }
}

//char *data_to_be_contained[] = {ESP8226_REQUEST_DISABLE_ECHO, USART_OK};
unsigned char is_usart_response_contains_elements(char *data_to_be_contained[], unsigned char elements_count) {
   for (unsigned char elements_index = 0; elements_index < elements_count; elements_index++) {
      if (!contains_string(usart_data_received_buffer, data_to_be_contained[elements_index])) {
         return 0;
      }
   }
   return 1;
}

unsigned char contains_string(char being_compared_string[], char string_to_be_contained[]) {
   unsigned char found = 0;

   if (*being_compared_string == '\0' || *string_to_be_contained == '\0') {
      return found;
   }

   for (; *being_compared_string != '\0'; being_compared_string++) {
      unsigned char all_chars_are_equal = 1;

      for (char *char_address = string_to_be_contained; *char_address != '\0';
            char_address++, being_compared_string++) {
         if (*being_compared_string == '\0') {
            return found;
         }

         all_chars_are_equal = *being_compared_string == *char_address ? 1 : 0;

         if (!all_chars_are_equal) {
            break;
         }
      }

      if (all_chars_are_equal) {
         found = 1;
         break;
      }
   }
   return found;
}

void disable_echo() {
   send_usard_data(ESP8226_REQUEST_DISABLE_ECHO);
   set_flag(&sent_flag, DISABLE_ECHO_FLAG);
}

void get_network_list() {
   send_usard_data(ESP8226_REQUEST_GET_VISIBLE_NETWORK_LIST);
   set_flag(&sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG);
}

void get_connection_status() {
   send_usard_data(ESP8226_REQUEST_GET_CONNECTION_STATUS);
   set_flag(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG);
}

void connect_to_network() {
   char *parameters[] = {DEFAULT_ACCESS_POINT_NAME, DEFAULT_ACCESS_POINT_PASSWORD, NULL};
   usart_data_to_be_transmitted_buffer = set_string_parameters(ESP8226_REQUEST_CONNECT_TO_NETWORK_AND_SAVE, parameters);
   send_usard_data(usart_data_to_be_transmitted_buffer);
   set_flag(&sent_flag, CONNECT_TO_NETWORK_FLAG);
}

void execute_usart_data_sending(void (*function_to_execute)(), unsigned char timeout) {
   send_usart_data_timout_s = timeout;
   send_usart_data_function = function_to_execute;
   function_to_execute();
}

void Clock_Config() {
   RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);
   RCC_PLLCmd(DISABLE);
   while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == SET);
   RCC_PLLConfig(RCC_PLLSource_HSI_Div2, RCC_PLLMul_4); // 8MHz / 2 * 4
   RCC_PCLKConfig(RCC_HCLK_Div1);
   RCC_PLLCmd(ENABLE);
   while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);
   RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
}

void Pins_Config() {
   // Connect BOOT0 to ground

