hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
   if (allocated_result == NULL) {
      return NULL;
   }

   unsigned char result_string_index = 0, input_string_index = 0;
   for (; result_string_index < result_string_length - 1; result_string_index++) {
      char input_string_symbol = string[input_string_index];

      if (input_string_symbol == '{') {
         input_string_index++;
         input_string_symbol = string[input_string_index] ;

         if (input_string_symbol < '1' || input_string_symbol > '9') {
            return NULL;
         }

         input_string_symbol -= 48; // Now it's not allocated_result char character, but allocated_result number
         if (input_string_symbol > parameters_length) {
            return NULL;
         }
         input_string_index += 2;

         // Parameters are starting with 1
         char *parameter = parameters[input_string_symbol - 1];

         for (; *parameter != '\0'; parameter++, result_string_index++) {
            *(allocated_result + result_string_index) = *parameter;
         }
         result_string_index--;
      } else {
         *(allocated_result + result_string_index) = string[input_string_index];
         input_string_index++;
      }
   }
   *(allocated_result + result_string_length - 1) = '\0';
   return allocated_result;
}

unsigned short get_string_length(char string[]) {
   unsigned short length = 0;

   for (char *string_pointer = string; *string_pointer != '\0'; string_pointer++, length++) {
   }
   return length;
}

void *short_to_string(unsigned short number) {
   if (number == 0) {
      return "0";
   }

   unsigned short remaining = number;
   unsigned short divider = 10000;
   unsigned char string_length = 0;
   char *result_string_pointer = NULL;

   for (unsigned char string_index = 5; string_index > 0; string_index--, divider /= 10) {
      char result_character = (char)(remaining / divider);

      if (result_string_pointer == NULL && result_character) {
         result_string_pointer = malloc(string_index + 1);
         string_length = string_index;
      }
      if (result_string_pointer != NULL) {
         unsigned char index = string_length - string_index;
         *(result_string_pointer + index) = result_character + 48;
      }

      remaining -= result_character * divider;
   }
   result_string_pointer[string_length] = '\0';
   return result_string_pointer;
}

void clear_usart_data_received_buffer() {
   for (int i = 0; i < USART_DATA_RECEIVED_BUFFER_SIZE; i++) {
      if (usart_data_received_buffer[i] == '\0') {
         break;
      }

      usart_data_received_buffer[i] = '\0';
   }
}
